areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c-sagittariusm-05.h
// Function declarations of port pin RC6
#if defined (_TRISC6)
static const P33C_GPIO_t PIN_RC6 = {
    .Properties.Port         = 2,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 6,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 54,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = -1,                      ///< (not available)
    .Properties.ADCORE       = -1,                      ///< (not available)
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RC6_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RC6_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RC6_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RC6_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RC6_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RC6_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RC6_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RC6_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RC6_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RC6_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RC6_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RC6_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RC6_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RC6_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RC6_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RC6_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RC6_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RC6

// Function declarations of port pin RC7
#if defined (_TRISC7)
static const P33C_GPIO_t PIN_RC7 = {
    .Properties.Port         = 2,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 7,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 55,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = 15,                      ///< Index of ADC input instance available at this device pin, =-1 if not available
    .Properties.ADCORE       = 7,                       ///< Index of ADC core connected to analog input of this pin, valid range: 0 to 7, =-1 if not available
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RC7_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RC7_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RC7_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RC7_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RC7_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RC7_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RC7_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RC7_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RC7_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RC7_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RC7_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RC7_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RC7_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RC7_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RC7_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RC7_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RC7_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RC7

// Function declarations of port pin RC8
#if defined (_TRISC8)
static const P33C_GPIO_t PIN_RC8 = {
    .Properties.Port         = 2,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 8,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 56,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = -1,                      ///< (not available)
    .Properties.ADCORE       = -1,                      ///< (not available)
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = 1,                       ///< Index of I2C peripheral instance available at this device pin, =-1 if not available
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = 2,                       ///< Index of SPI peripheral instance available at this device pin, =-1 if not available
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #ifdef I2C1CONL
    .Objects.I2C             = (P33C_I2C_INSTANCE_t*)&I2C1CONL, ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #else
    .Objects.I2C             = NULL,                    ///< (not available)
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #ifdef SPI2CON1L
    .Objects.SPI             = (P33C_SPI_INSTANCE_t*)&SPI2CON1L, ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #else
    .Objects.SPI             = NULL,                    ///< (not available)
    #endif
    .Methods.Get            = &__builtin_RC8_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RC8_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RC8_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RC8_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RC8_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RC8_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RC8_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RC8_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RC8_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RC8_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RC8_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RC8_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RC8_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RC8_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RC8_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RC8_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RC8_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RC8

// Function declarations of port pin RC9
#if defined (_TRISC9)
static const P33C_GPIO_t PIN_RC9 = {
    .Properties.Port         = 2,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 9,                       ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 57,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = -1,                      ///< (not available)
    .Properties.ADCORE       = -1,                      ///< (not available)
    .Properties.CMPxIN       = -1,                      ///< (not available)
    .Properties.DAC          = -1,                      ///< (not available)
    .Properties.I2C          = 1,                       ///< Index of I2C peripheral instance available at this device pin, =-1 if not available
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = 2,                       ///< Index of SPI peripheral instance available at this device pin, =-1 if not available
    #if (P33C_DAC_COUNT > 0)
    .Objects.DAC             = NULL,                    ///< Pointer to DAC/Comparator instance data object available at this device pin
    #endif
    #ifdef I2C1CONL
    .Objects.I2C             = (P33C_I2C_INSTANCE_t*)&I2C1CONL, ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #else
    .Objects.I2C             = NULL,                    ///< (not available)
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #ifdef SPI2CON1L
    .Objects.SPI             = (P33C_SPI_INSTANCE_t*)&SPI2CON1L, ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #else
    .Objects.SPI             = NULL,                    ///< (not available)
    #endif
    .Methods.Get            = &__builtin_RC9_Get,       ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RC9_Set,       ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RC9_Clear,     ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RC9_Toggle,    ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RC9_SetInput,  ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RC9_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RC9_SetState,  ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RC9_Init,      ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RC9_Dispose,   ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RC9_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RC9_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RC9_GetPullUp, ///< Gets the connection state of the pin's pull up resistor 
    .Methods.SetPullUp      = &__builtin_RC9_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RC9_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RC9_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RC9_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RC9_SetDigital ///< Disable analog functions of this pin
};
